
## Plan Result (shared)

[CI link](https://github.com/goda6565/portfolio/actions/runs/16169608457)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.auth_service_jwt_secret.google_secret_manager_secret.secret
  * module.auth_service_user_email.google_secret_manager_secret.secret
  * module.auth_service_user_password.google_secret_manager_secret.secret
  * module.cloudbuild_auth_trigger.google_cloudbuild_trigger.github_trigger


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.auth_service_jwt_secret.google_secret_manager_secret.secret will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "portfolio-460206"
      + secret_id             = "auth-service-jwt-secret"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-northeast1"
                }
            }
        }
    }

  # module.auth_service_user_email.google_secret_manager_secret.secret will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "portfolio-460206"
      + secret_id             = "auth-service-user-email"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-northeast1"
                }
            }
        }
    }

  # module.auth_service_user_password.google_secret_manager_secret.secret will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "portfolio-460206"
      + secret_id             = "auth-service-user-password"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-northeast1"
                }
            }
        }
    }

  # module.cloudbuild_auth_trigger.google_cloudbuild_trigger.github_trigger will be created
  + resource "google_cloudbuild_trigger" "github_trigger" {
      + create_time        = (known after apply)
      + description        = "Build trigger for auth-service"
      + filename           = "manifests/cloudbuild/auth-service.yaml"
      + id                 = (known after apply)
      + include_build_logs = "INCLUDE_BUILD_LOGS_WITH_STATUS"
      + included_files     = [
          + "apps/auth-service/**",
        ]
      + location           = "us-west2"
      + name               = "auth-service-trigger"
      + project            = "portfolio-460206"
      + service_account    = "projects/portfolio-460206/serviceAccounts/cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + trigger_id         = (known after apply)

      + approval_config (known after apply)

      + repository_event_config {
          + repository = "projects/portfolio-460206/locations/us-west2/connections/github-connection/repositories/portfolio"

          + push {
              + branch = "^(main|feat/.*)$"
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label shared/add-or-update: POST https://api.github.com/repos/goda6565/portfolio/issues/52/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":52,"Program":"tfcmt","SHA1":"14f59bfb03cb20d12c65146a650755766553abb1","Target":"shared","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->